app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        log_message('debug', 'Login attempt - Username: ' . $username);

        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'staff'
 LIMIT 1