app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $productModel = new ProductModel();
        $userModel = new UserModel();

        $data['totalProducts'] = $productModel->countAll();
        $data['totalUsers'] = $userModel->countAll();
        $data['recentProducts'] = $productModel->orderBy('created_at', 'DESC')->findAll(5);
---
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `products`
ORDER BY `created_at` DESC
 LIMIT 5