app/Controllers/Products.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `products`

    public function store()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $productModel = new ProductModel();

        $data = [
            'product_name' => $this->request->getPost('product_name'),
            'description' => $this->request->getPost('description'),
            'price' => $this->request->getPost('price'),
            'stock' => $this->request->getPost('stock')
        ];

        if ($productModel->insert($data)) {
---
INSERT INTO `products` (`product_name`, `description`, `price`, `stock`, `created_at`, `updated_at`) VALUES ('Hotdog', 'Cheese ', '20', '40', '2025-10-08 03:44:21', '2025-10-08 03:44:21')

    public function delete($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $productModel = new ProductModel();

        if ($productModel->delete($id)) {
---
DELETE FROM `products`
WHERE `id` IN ('5')