app/Controllers/Users.php

    public function index()
    {
        $redirect = $this->checkAdminAccess();
        if ($redirect) return $redirect;

        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`